<?PHP
/*
4、门诊缴费 对应的是 哪个？我看有个 【5.门诊收费初始化】 还有个 【6.门诊收费】
Mr.Zhong:
初始化是获取门诊收费的具体信息

Mr.Zhong:
门诊收费的话，是患者交费之后，把相关信息回传给his做记录的

韩述:
请问是不是每次缴费，都要【5.门诊收费初始化】 和【6.门诊收费】一起调用？

Mr.Zhong:
是，你不调用初始化也拿不到交费的具体信息，自然也就没办法缴费了

*/

//5.门诊收费初始化
include_once 'ProcedureHelper.php';

$pdo = new StoredProcHelper();

$jzkh = '123';

$sql = 'exec dbo.PRO_YW_MZSF_CSH @JZKH = :JZKH,@WXOPENID = :WXOPENID,@CZYDM = :CZYDM;';
$pdo->prepare($sql);

$pdo->bindParam(':JZKH',$jzkh, PDO::PARAM_STR);
$pdo->bindParam(':WXOPENID',"wxopenid", PDO::PARAM_STR);
$pdo->bindParam(':CZYDM',"wxzf", PDO::PARAM_STR);

$res = $pdo->fetchAll();
if(count($res[0]) == 0){
	print "没有收费信息";
	exit();
}
$ssje = floatval($res[0][2]['ZJE']);
$ypmc = trim($res[0][2]['YPMC']);
$dh = trim($res[0][2]['DH']);

//print_r($res);
printf("就诊卡号：%s --单号：%s -- %s 需要支付：%f 元。\n", $jzkh, $dh,$ypmc, $ssje);

//==============================
/*6.门诊收费 PRO_YW_MZSF*/
$sql = 'exec dbo.PRO_YW_MZSF @jzkh = :jzkh,@ssje = :ssje,@CZYDM = :CZYDM,@wxddh=:wxddh,@wxopenid=:wxopenid,@zffs=:zffs,@czydm=:czydm;';
$pdo->prepare($sql);

$pdo->bindParam(':jzkh',$jzkh, PDO::PARAM_STR);
$pdo->bindParam(':ssje',$ssje);
$pdo->bindParam(':wxddh',"微信单号7", PDO::PARAM_STR);
$pdo->bindParam('wxopenid',"wxopenid", PDO::PARAM_STR);
$pdo->bindParam('zffs',"88", PDO::PARAM_STR);
$pdo->bindParam('czydm',"wxzf", PDO::PARAM_STR);
/*
-------------------------------------------  
--方法说明：门诊--收费--初始化
-------------------------------------------  
--参数说明：  
 
*/
$res = $pdo->fetchAll();
print_r($res);


/*
@jzkh  VARCHAR(50),                                                                                                                              
 @ssje  DECIMAL(18,2),
 @wxddh  VARCHAR(100),
 @wxopenid  VARCHAR(100),
 @zffs  VARCHAR(10),
 @czydm  VARCHAR(4),
 @psfs  VARCHAR(1) = '0',
 @shrxm  VARCHAR(50) = NULL,
 @shrdh  VARCHAR(20) = NULL,
 @shrdz  VARCHAR(200) = NULL
 
 /*    
-------------------------------------------    
--方法说明：门诊收费--收费
-------------------------------------------    
--参数说明：   
 @jzkh          记账卡号
 @ssje          收费金额
 @wxddh   微信订单号
 @wxopenid  微信openid
 @zffs   支付方式
 @czydm   操作代码
 @psfs   配送方式  0:自取（默认）    1:快递
 @shrxm   收货人姓名
 @shrdh   收货人电话
 @shrdz   收货人地址
 ------------------------------------------    

Active code page: 65001
have 18 recodes.
Array
(
    [0] => Array
        (
            [0] => Array
                (
                    [DH] => A808711086
                    [0] => A808711086
                    [YPDM] => 100004
                    [1] => 100004
                    [YPMC] => 开塞露                                                                                    
                    [2] => 开塞露                                                                                       
                    [SL] => 1
                    [3] => 1
                    [LSJ] => 1.00
                    [4] => 1.00
                    [SSJE] => 1.00
                    [5] => 1.00
                    [SXH] => 1
                    [6] => 1
                    [ZJE] => 923.73
                    [7] => 923.73
                )

            [1] => Array
                (
                    [DH] => A808711086
                    [0] => A808711086
                    [YPDM] => 100014
                    [1] => 100014
                    [YPMC] => 北豆根胶囊                                                                                
                    [2] => 北豆根胶囊                                                                                   
                    [SL] => 1
                    [3] => 1
                    [LSJ] => 7.71
                    [4] => 7.71
                    [SSJE] => 7.71
                    [5] => 7.71
                    [SXH] => 2
                    [6] => 2
                    [ZJE] => 923.73
                    [7] => 923.73
                )

            [2] => Array
                (
                    [DH] => A808711087
                    [0] => A808711087
                    [YPDM] => 300002
                    [1] => 300002
                    [YPMC] => 八角茴香                                                                                  
                    [2] => 八角茴香                                                                                     
                    [SL] => 3
                    [3] => 3
                    [LSJ] => .04
                    [4] => .04
                    [SSJE] => .12
                    [5] => .12
                    [SXH] => 1
                    [6] => 1
                    [ZJE] => 923.73
                    [7] => 923.73
                )

            [3] => Array
                (
                    [DH] => A808711088
                    [0] => A808711088
                    [YPDM] => 21030000001
                    [1] => 21030000001
                    [YPMC] => X线计算机体层(CT)扫描(使用螺旋扫描加收)
                    [2] => X线计算机体层(CT)扫描(使用螺旋扫描加收)
                    [SL] => 1
                    [3] => 1
                    [LSJ] => 60.00
                    [4] => 60.00
                    [SSJE] => 60.00
                    [5] => 60.00
                    [SXH] => 12
                    [6] => 12
                    [ZJE] => 923.73
                    [7] => 923.73
                )

            [4] => Array
                (
                    [DH] => A808711088
                    [0] => A808711088
                    [YPDM] => 21030000100
                    [1] => 21030000100
                    [YPMC] => X线计算机体层(CT)平扫
                    [2] => X线计算机体层(CT)平扫
                    [SL] => 1
                    [3] => 1
                    [LSJ] => 120.00
                    [4] => 120.00
                    [SSJE] => 120.00
                    [5] => 120.00
                    [SXH] => 11
                    [6] => 11
                    [ZJE] => 923.73
                    [7] => 923.73
                )

            [5] => Array
                (
                    [DH] => A808711089
                    [0] => A808711089
                    [YPDM] => 21030000001
                    [1] => 21030000001
                    [YPMC] => X线计算机体层(CT)扫描(使用螺旋扫描加收)
                    [2] => X线计算机体层(CT)扫描(使用螺旋扫描加收)
                    [SL] => 1
                    [3] => 1
                    [LSJ] => 60.00
                    [4] => 60.00
                    [SSJE] => 60.00
                    [5] => 60.00
                    [SXH] => 21
                    [6] => 21
                    [ZJE] => 923.73
                    [7] => 923.73
                )

            [6] => Array
                (
                    [DH] => A808711089
                    [0] => A808711089
                    [YPDM] => 21030000100
                    [1] => 21030000100
                    [YPMC] => X线计算机体层(CT)平扫
                    [2] => X线计算机体层(CT)平扫
                    [SL] => 1
                    [3] => 1
                    [LSJ] => 120.00
                    [4] => 120.00
                    [SSJE] => 120.00
                    [5] => 120.00
                    [SXH] => 22
                    [6] => 22
                    [ZJE] => 923.73
                    [7] => 923.73
                )

            [7] => Array
                (
                    [DH] => A808711090
                    [0] => A808711090
                    [YPDM] => 2503050080300
                    [1] => 2503050080300
                    [YPMC] => 血清天门冬氨酸氨基转移酶测定速率法..
                    [2] => 血清天门冬氨酸氨基转移酶测定速率法..
                    [SL] => 1
                    [3] => 1
                    [LSJ] => 4.00
                    [4] => 4.00
                    [SSJE] => 4.00
                    [5] => 4.00
                    [SXH] => 14
                    [6] => 14
                    [ZJE] => 923.73
                    [7] => 923.73
                )

            [8] => Array
                (
                    [DH] => A808711090
                    [0] => A808711090
                    [YPDM] => 25030600102
                    [1] => 25030600102
                    [YPMC] => 血清肌酸激酶测定速率法                                                                    
                    [2] => 血清肌酸激酶测定速率法                                                                       
                    [SL] => 1
                    [3] => 1
                    [LSJ] => 4.00
                    [4] => 4.00
                    [SSJE] => 4.00
                    [5] => 4.00
                    [SXH] => 11
                    [6] => 11
                    [ZJE] => 923.73
                    [7] => 923.73
                )

            [9] => Array
                (
                    [DH] => A808711090
                    [0] => A808711090
                    [YPDM] => 25030600203
                    [1] => 25030600203
                    [YPMC] => 血清肌酸激酶-MB同工酶测定速率法
                    [2] => 血清肌酸激酶-MB同工酶测定速率法
                    [SL] => 1
                    [3] => 1
                    [LSJ] => 8.00
                    [4] => 8.00
                    [SSJE] => 8.00
                    [5] => 8.00
                    [SXH] => 16
                    [6] => 16
                    [ZJE] => 923.73
                    [7] => 923.73
                )

            [10] => Array
                (
                    [DH] => A808711090
                    [0] => A808711090
                    [YPDM] => 25030600502
                    [1] => 25030600502
                    [YPMC] => 乳酸脱氢酶测定速率法                                                                      
                    [2] => 乳酸脱氢酶测定速率法                                                                         
                    [SL] => 1
                    [3] => 1
                    [LSJ] => 5.00
                    [4] => 5.00
                    [SSJE] => 5.00
                    [5] => 5.00
                    [SXH] => 12
                    [6] => 12
                    [ZJE] => 923.73
                    [7] => 923.73
                )

            [11] => Array
                (
                    [DH] => A808711090
                    [0] => A808711090
                    [YPDM] => 250306007
                    [1] => 250306007
                    [YPMC] => 羟丁酸脱氢酶速率法
                    [2] => 羟丁酸脱氢酶速率法
                    [SL] => 1
                    [3] => 1
                    [LSJ] => 4.00
                    [4] => 4.00
                    [SSJE] => 4.00
                    [5] => 4.00
                    [SXH] => 13
                    [6] => 13
                    [ZJE] => 923.73
                    [7] => 923.73
                )

            [12] => Array
                (
                    [DH] => A808711090
                    [0] => A808711090
                    [YPDM] => 25030600902
                    [1] => 25030600902
                    [YPMC] => 血清肌钙蛋白I测定各种免疫学法.
                    [2] => 血清肌钙蛋白I测定各种免疫学法.
                    [SL] => 1
                    [3] => 1
                    [LSJ] => 40.00
                    [4] => 40.00
                    [SSJE] => 40.00
                    [5] => 40.00
                    [SXH] => 17
                    [6] => 17
                    [ZJE] => 923.73
                    [7] => 923.73
                )

            [13] => Array
                (
                    [DH] => A808711090
                    [0] => A808711090
                    [YPDM] => 25030601001
                    [1] => 25030601001
                    [YPMC] => 血清肌红蛋白各种免疫学法
                    [2] => 血清肌红蛋白各种免疫学法
                    [SL] => 1
                    [3] => 1
                    [LSJ] => 16.00
                    [4] => 16.00
                    [SSJE] => 16.00
                    [5] => 16.00
                    [SXH] => 15
                    [6] => 15
                    [ZJE] => 923.73
                    [7] => 923.73
                )

            [14] => Array
                (
                    [DH] => A808711091
                    [0] => A808711091
                    [YPDM] => 25030700103
                    [1] => 25030700103
                    [YPMC] => 尿素测定酶促动力学法
                    [2] => 尿素测定酶促动力学法
                    [SL] => 1
                    [3] => 1
                    [LSJ] => 5.00
                    [4] => 5.00
                    [SSJE] => 5.00
                    [5] => 5.00
                    [SXH] => 23
                    [6] => 23
                    [ZJE] => 923.73
                    [7] => 923.73
                )

            [15] => Array
                (
                    [DH] => A808711091
                    [0] => A808711091
                    [YPDM] => 25030700202
                    [1] => 25030700202
                    [YPMC] => 肌酐测定酶促动力学法                                                                      
                    [2] => 肌酐测定酶促动力学法                                                                         
                    [SL] => 1
                    [3] => 1
                    [LSJ] => 5.00
                    [4] => 5.00
                    [SSJE] => 5.00
                    [5] => 5.00
                    [SXH] => 21
                    [6] => 21
                    [ZJE] => 923.73
                    [7] => 923.73
                )

            [16] => Array
                (
                    [DH] => A808711091
                    [0] => A808711091
                    [YPDM] => 25030700500
                    [1] => 25030700500
                    [YPMC] => 血清尿酸测定                                                                              
                    [2] => 血清尿酸测定                                                                                 
                    [SL] => 1
                    [3] => 1
                    [LSJ] => 4.00
                    [4] => 4.00
                    [SSJE] => 4.00
                    [5] => 4.00
                    [SXH] => 22
                    [6] => 22
                    [ZJE] => 923.73
                    [7] => 923.73
                )

            [17] => Array
                (
                    [DH] => A808711092
                    [0] => A808711092
                    [YPDM] => 000010011
                    [1] => 000010011
                    [YPMC] => 医用夹板12*76*0.75cm
                    [2] => 医用夹板12*76*0.75cm
                    [SL] => 1
                    [3] => 1
                    [LSJ] => 459.90
                    [4] => 459.90
                    [SSJE] => 459.90
                    [5] => 459.90
                    [SXH] => 1
                    [6] => 1
                    [ZJE] => 923.73
                    [7] => 923.73
                )

        )

)
rechage ok
请按任意键继续. . .
*/